# https://pandas.pydata.org/pandas-docs/stable/10min.html

In [2]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline
matplotlib.style.use('ggplot')

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101',periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2013-01-01 -0.284128  0.827160  0.925393 -0.486746
2013-01-02 -0.325892 -2.467384  0.196862  0.763915
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229
2013-01-04  0.206226  0.146900 -0.368509  1.353252
2013-01-05 -1.702615  0.044249 -0.473473  0.219163
2013-01-06  1.312533  1.193245 -0.201074  1.320620

In [12]:
df2 = pd.DataFrame({ 'A' : 1.,
   ...:              'B' : pd.Timestamp('20130102'),
   ...:              'C' : pd.Series(1,index=range(4),dtype='float32'),
   ...:              'D' : np.array([3] * 4,dtype='int32'),
   ...:              'E' : 'foo' })
   ...:

In [13]:
df2

     A          B    C  D    E
0  1.0 2013-01-02  1.0  3  foo
1  1.0 2013-01-02  1.0  3  foo
2  1.0 2013-01-02  1.0  3  foo
3  1.0 2013-01-02  1.0  3  foo

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
dtype: object

In [15]:
df.head()

                   A         B         C         D
2013-01-01 -0.284128  0.827160  0.925393 -0.486746
2013-01-02 -0.325892 -2.467384  0.196862  0.763915
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229
2013-01-04  0.206226  0.146900 -0.368509  1.353252
2013-01-05 -1.702615  0.044249 -0.473473  0.219163

In [16]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.206226  0.146900 -0.368509  1.353252
2013-01-05 -1.702615  0.044249 -0.473473  0.219163
2013-01-06  1.312533  1.193245 -0.201074  1.320620

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.254368 -0.064754 -0.148627  0.618072
std    0.999919  1.281561  0.648959  0.698779
min   -1.702615 -2.467384 -0.970960 -0.486746
25%   -0.630721 -0.088455 -0.447232  0.298930
50%   -0.305010  0.095574 -0.284792  0.651072
75%    0.083638  0.657095  0.097378  1.181444
max    1.312533  1.193245  0.925393  1.353252

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.284128   -0.325892   -0.732330    0.206226   -1.702615    1.312533
B    0.827160   -2.467384   -0.132690    0.146900    0.044249    1.193245
C    0.925393    0.196862   -0.970960   -0.368509   -0.473473   -0.201074
D   -0.486746    0.763915    0.538229    1.353252    0.219163    1.320620

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.486746  0.925393  0.827160 -0.284128
2013-01-02  0.763915  0.196862 -2.467384 -0.325892
2013-01-03  0.538229 -0.970960 -0.132690 -0.732330
2013-01-04  1.353252 -0.368509  0.146900  0.206226
2013-01-05  0.219163 -0.473473  0.044249 -1.702615
2013-01-06  1.320620 -0.201074  1.193245  1.312533

In [22]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06  1.312533  1.193245 -0.201074  1.320620
2013-01-01 -0.284128  0.827160  0.925393 -0.486746
2013-01-04  0.206226  0.146900 -0.368509  1.353252
2013-01-05 -1.702615  0.044249 -0.473473  0.219163
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229
2013-01-02 -0.325892 -2.467384  0.196862  0.763915

In [26]:
df['A']

2013-01-01   -0.284128
2013-01-02   -0.325892
2013-01-03   -0.732330
2013-01-04    0.206226
2013-01-05   -1.702615
2013-01-06    1.312533
Freq: D, Name: A, dtype: float64

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.284128  0.827160  0.925393 -0.486746
2013-01-02 -0.325892 -2.467384  0.196862  0.763915
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229

In [29]:
df[pd.Timestamp('20130102'):pd.Timestamp('20130104')]

                   A         B         C         D
2013-01-02 -0.325892 -2.467384  0.196862  0.763915
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229
2013-01-04  0.206226  0.146900 -0.368509  1.353252

In [31]:
df.loc[dates[0]]

A   -0.284128
B    0.827160
C    0.925393
D   -0.486746
Name: 2013-01-01 00:00:00, dtype: float64

In [49]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.284128  0.827160
2013-01-02 -0.325892 -2.467384
2013-01-03 -0.732330 -0.132690
2013-01-04  0.206226  0.146900
2013-01-05 -1.702615  0.044249
2013-01-06  1.312533  1.193245

In [50]:
df.loc[pd.Timestamp('20130102'):pd.Timestamp('20130104'),['A','B']]

                   A         B
2013-01-02 -0.325892 -2.467384
2013-01-03 -0.732330 -0.132690
2013-01-04  0.206226  0.146900

In [23]:
df.loc['20130102',['A','B']]

A   -0.041653
B   -0.358252
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
df.loc[dates[0],'A']

-1.75848203220153

In [25]:
df.at[dates[0],'A']

-1.75848203220153

In [57]:
df.iloc[3]

A    0.206226
B    0.146900
C   -0.368509
D    1.353252
Name: 2013-01-04 00:00:00, dtype: float64

In [56]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.206226  0.146900
2013-01-05 -1.702615  0.044249

In [28]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.041653  0.297617
2013-01-03  0.084049  1.262813
2013-01-05  0.116444 -0.872851

In [29]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.041653 -0.358252  0.297617 -0.594584
2013-01-03  0.084049 -0.108218  1.262813  0.942892

In [64]:
df.iloc[:,:]

                   A         B         C         D
2013-01-01 -0.284128  0.827160  0.925393 -0.486746
2013-01-02 -0.325892 -2.467384  0.196862  0.763915
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229
2013-01-04  0.206226  0.146900 -0.368509  1.353252
2013-01-05 -1.702615  0.044249 -0.473473  0.219163
2013-01-06  1.312533  1.193245 -0.201074  1.320620

In [61]:
df.iloc[1,1]

-2.4673842098454575

In [63]:
df.iat[1,1]

-2.4673842098454575

In [65]:
x = list('abcdef')

In [68]:
x[4:10]

['e', 'f']

In [69]:
x[8:10]

[]

In [70]:
df.iloc[:,8:10]

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

In [73]:
df[df.A > 0]

                   A         B         C         D
2013-01-01 -0.284128  0.827160  0.925393 -0.486746
2013-01-02 -0.325892 -2.467384  0.196862  0.763915
2013-01-03 -0.732330 -0.132690 -0.970960  0.538229
2013-01-04  0.206226  0.146900 -0.368509  1.353252
2013-01-05 -1.702615  0.044249 -0.473473  0.219163
2013-01-06  1.312533  1.193245 -0.201074  1.320620

In [72]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.827160  0.925393       NaN
2013-01-02       NaN       NaN  0.196862  0.763915
2013-01-03       NaN       NaN       NaN  0.538229
2013-01-04  0.206226  0.146900       NaN  1.353252
2013-01-05       NaN  0.044249       NaN  0.219163
2013-01-06  1.312533  1.193245       NaN  1.320620

In [76]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

In [77]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [78]:
df['F'] = s1

In [79]:
df.at[dates[0],'A'] = 0

In [80]:
df.iat[0,1] = 0

In [81]:
df.loc[:,'D'] = np.array([5] * len(df))

In [82]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.925393  5  NaN
2013-01-02 -0.325892 -2.467384  0.196862  5  1.0
2013-01-03 -0.732330 -0.132690 -0.970960  5  2.0
2013-01-04  0.206226  0.146900 -0.368509  5  3.0
2013-01-05 -1.702615  0.044249 -0.473473  5  4.0
2013-01-06  1.312533  1.193245 -0.201074  5  5.0

In [83]:
df2 = df.copy()

In [84]:
df2[df2 > 0] = -df2

In [85]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.925393 -5  NaN
2013-01-02 -0.325892 -2.467384 -0.196862 -5 -1.0
2013-01-03 -0.732330 -0.132690 -0.970960 -5 -2.0
2013-01-04 -0.206226 -0.146900 -0.368509 -5 -3.0
2013-01-05 -1.702615 -0.044249 -0.473473 -5 -4.0
2013-01-06 -1.312533 -1.193245 -0.201074 -5 -5.0

In [87]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.925393  5  NaN NaN
2013-01-02 -0.325892 -2.467384  0.196862  5  1.0 NaN
2013-01-03 -0.732330 -0.132690 -0.970960  5  2.0 NaN
2013-01-04  0.206226  0.146900 -0.368509  5  3.0 NaN

In [88]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [91]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.925393  5  NaN  1.0
2013-01-02 -0.325892 -2.467384  0.196862  5  1.0  1.0
2013-01-03 -0.732330 -0.132690 -0.970960  5  2.0  NaN
2013-01-04  0.206226  0.146900 -0.368509  5  3.0  NaN

In [89]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.325892 -2.467384  0.196862  5  1.0  1.0

In [90]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.925393  5  5.0  1.0
2013-01-02 -0.325892 -2.467384  0.196862  5  1.0  1.0
2013-01-03 -0.732330 -0.132690 -0.970960  5  2.0  5.0
2013-01-04  0.206226  0.146900 -0.368509  5  3.0  5.0

In [92]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [93]:
df.mean()

A   -0.207013
B   -0.202613
C   -0.148627
D    5.000000
F    3.000000
dtype: float64

In [96]:
df.mean(1)

2013-01-01    1.481348
2013-01-02    0.680717
2013-01-03    1.032804
2013-01-04    1.596923
2013-01-05    1.373632
2013-01-06    2.460941
Freq: D, dtype: float64

In [99]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)

In [100]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [103]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.732330 -1.132690 -1.970960  4.0  1.0
2013-01-04 -2.793774 -2.853100 -3.368509  2.0  0.0
2013-01-05 -6.702615 -4.955751 -5.473473  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [104]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.925393   5   NaN
2013-01-02 -0.325892 -2.467384  1.122255  10   1.0
2013-01-03 -1.058222 -2.600074  0.151295  15   3.0
2013-01-04 -0.851996 -2.453175 -0.217214  20   6.0
2013-01-05 -2.554611 -2.408926 -0.690687  25  10.0
2013-01-06 -1.242078 -1.215681 -0.891760  30  15.0

In [105]:
df.apply(lambda x: x.max() - x.min())

A    3.015147
B    3.660629
C    1.896352
D    0.000000
F    4.000000
dtype: float64

In [106]:
s = pd.Series(np.random.randint(0,7,size=10))

In [108]:
s

0    5
1    1
2    1
3    3
4    0
5    1
6    5
7    6
8    6
9    6
dtype: int64

In [109]:
s.value_counts()

6    3
1    3
5    2
3    1
0    1
dtype: int64

In [110]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [111]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [112]:
df = pd.DataFrame(np.random.randn(10, 4))

In [113]:
df

          0         1         2         3
0  0.341327 -2.258402 -0.233322  0.408302
1 -0.551190  1.274214  0.146697  0.535478
2 -0.578646 -0.211077 -1.026026  0.038610
3  0.605810 -0.803219  0.219700 -0.194795
4  0.010575  0.538877  0.714502 -0.547470
5  1.043184 -3.099384  0.049931 -0.045563
6 -0.818157  0.406361  1.584883 -0.276504
7 -1.017403  0.209351  0.569920  0.470226
8  0.256399 -0.691359  1.112625 -0.150572
9  0.168216  1.338228 -0.072188  1.271906

In [116]:
pieces = [df[:3], df[4:7], df[7:]]

In [117]:
pd.concat(pieces)

          0         1         2         3
0  0.341327 -2.258402 -0.233322  0.408302
1 -0.551190  1.274214  0.146697  0.535478
2 -0.578646 -0.211077 -1.026026  0.038610
4  0.010575  0.538877  0.714502 -0.547470
5  1.043184 -3.099384  0.049931 -0.045563
6 -0.818157  0.406361  1.584883 -0.276504
7 -1.017403  0.209351  0.569920  0.470226
8  0.256399 -0.691359  1.112625 -0.150572
9  0.168216  1.338228 -0.072188  1.271906

In [118]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [119]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [120]:
left

   key  lval
0  foo     1
1  foo     2

In [74]:
right

   key  rval
0  foo     4
1  foo     5

In [75]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [121]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.018479  0.167996
1  bar    one  1.610907 -0.669246
2  foo    two  0.459483 -0.834347
3  bar  three  0.282276 -1.151975
4  foo    two  1.925785  0.585911
5  bar    two  1.368921 -0.406593
6  foo    one  0.755462  0.975603
7  foo  three -0.140644 -0.118963

In [77]:
df.groupby('A').sum()

            C         D
A
bar  6.303472 -0.587586
foo -0.622055 -4.659962

In [78]:
 df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    2.235396 -0.497729
    three  1.793133  0.340301
    two    2.274943 -0.430157
foo one    1.337473 -1.356720
    three -0.508485 -1.156688
    two   -1.451044 -2.146554